zup/ЗУП_бюджет/src/InformationRegisters/ВоинскиеСпециальныеЗванияФизическихЛиц/ВоинскиеСпециальныеЗванияФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВоинскиеСпециальныеЗванияФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВоинскоеСпециальноеЗвание</name>
    <type>
      <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/ОкладыПоВоинскимСпециальнымЗваниям/ОкладыПоВоинскимСпециальнымЗваниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОкладыПоВоинскимСпециальнымЗваниям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВоинскоеСпециальноеЗвание</name>
    <type>
      <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/ВидыДоговоровССотрудниками/ВидыДоговоровССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровССотрудниками</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонтрактГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоговорМуниципальногоСлужащего</name>
  </enumValues>
  <enumValues>
    <name>КонтрактВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ВоеннослужащийПоПризыву</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ДействияСНачислениямиИУдержаниями/ДействияСНачислениямиИУдержаниями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияСНачислениямиИУдержаниями</name>
  <enumValues>
    <name>Утвердить</name>
  </enumValues>
  <enumValues>
    <name>Отменить</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Documents/ЗачислениеВСпискиЧасти/ЗачислениеВСпискиЧасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачислениеВСпискиЧасти</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ПорядокРасчетаСтоимостиЕдиницыВремениСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеПозицииШтатногоРасписания</registerRecords>
  <registerRecords>InformationRegister.УдалитьЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ГрафикРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.ДанныеСостоянийСотрудников</registerRecords>
  <registerRecords>InformationRegister.КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ВоинскиеСпециальныеЗванияФизическихЛиц</registerRecords>
  <registerRecords>InformationRegister.ТерриторииСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.ВидыЗанятостиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВступилВДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдовлетворенДенежнымДовольствиемНаПредыдущемМестеСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдовлетворенияДенежнымДовольствием</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.ТерриторииВыполненияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ЗачислениеВСпискиЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровССотрудниками</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплатыВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВоинскоеСпециальноеЗвание</name>
    <type>
      <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетаСтоимостиЕдиницыВремени</name>
    <type>
      <types>EnumRef.ПорядокРасчетаСтоимостиЕдиницыВремениОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>СовокупнаяТарифнаяСтавка</name>
    <type>
      <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТарифнойСтавки</name>
    <type>
      <types>EnumRef.ВидыТарифныхСтавок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияДоЗачисленияВСпискиЧасти</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ИдентификаторСтрокиВидаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/ПрисвоениеВоинскогоСпециальногоЗвания/ПрисвоениеВоинскогоСпециальногоЗвания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоениеВоинскогоСпециальногоЗвания</name>
  <registerRecords>InformationRegister.УдалитьЗначенияСовокупныхТарифныхСтавокСотрудников</registerRecords>
  <registerRecords>InformationRegister.ВоинскиеСпециальныеЗванияФизическихЛиц</registerRecords>
  <registerRecords>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</registerRecords>
  <registerRecords>InformationRegister.БухучетПлановыхНачислений</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВоинскоеСпециальноеЗвание</name>
    <type>
      <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачисленияУтверждены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СовокупнаяТарифнаяСтавка</name>
    <type>
      <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТарифнойСтавки</name>
    <type>
      <types>EnumRef.ВидыТарифныхСтавок</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ОснованиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Documents/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания/УтверждениеОкладовЗаВоинскиеСпециальныеЗвания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеОкладовЗаВоинскиеСпециальныеЗвания</name>
  <registerRecords>InformationRegister.ОкладыПоВоинскимСпециальнымЗваниям</registerRecords>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оклады</name>
    <attributes>
      <name>ВоинскоеСпециальноеЗвание</name>
      <type>
        <types>CatalogRef.ВоинскиеСпециальныеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Catalogs/ВоинскиеСпециальныеЗвания/ВоинскиеСпециальныеЗвания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВоинскиеСпециальныеЗвания</name>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/CommonModules/ВоинскиеСпециальныеЗвания/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполняет наборы записей регистра ВоинскиеСпециальныеЗванияФизическихЛиц.
// Параметры:
//		Движения - коллекция движений регистратора.
//		ВоинскиеСпециальныеЗванияФизическихЛиц - таблица значений с колонками
//			ДатаСобытия
//			ФизическоеЛицо
//			ВоинскоеСпециальноеЗвание
//			ДействуетДо
//
Процедура СформироватьДвиженияВоинскихСпециальныхЗванийФизическихЛиц(Движения, ВоинскиеСпециальныеЗванияФизическихЛиц) Экспорт
	
	Если Не ЗначениеЗаполнено(ВоинскиеСпециальныеЗванияФизическихЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = Движения.ВоинскиеСпециальныеЗванияФизическихЛиц.Отбор.Регистратор.Значение;
	
	// Дополняем таблицу полем ПорядокРасчетаПоОкончании.
	КлючевыеИзмерения = "ДатаПрисвоения,ФизическоеЛицо";
	
	ИзмеренияДаты = Новый ТаблицаЗначений;
	ИзмеренияДаты.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ИзмеренияДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Для Каждого СтрокаДвижений Из ВоинскиеСпециальныеЗванияФизическихЛиц Цикл 
		НоваяСтрока = ИзмеренияДаты.Добавить();
		НоваяСтрока.ФизическоеЛицо = СтрокаДвижений.ФизическоеЛицо;
		НоваяСтрока.Период = СтрокаДвижений.ДатаПрисвоения;
	КонецЦикла;
	
	ИзмеренияДаты.Свернуть("ФизическоеЛицо, Период");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Ложь;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", Регистратор);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ВоинскиеСпециальныеЗванияФизическихЛиц",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИзмеренияДаты),
		ПараметрыПостроения);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВоинскиеСпециальныеЗванияФизическихЛиц.Период, ДЕНЬ) КАК ДатаПрисвоения,
	|	ВоинскиеСпециальныеЗванияФизическихЛиц.ФизическоеЛицо,
	|	ВоинскиеСпециальныеЗванияФизическихЛиц.ВоинскоеСпециальноеЗвание КАК ТекущееЗначение
	|ИЗ
	|	ВТВоинскиеСпециальныеЗванияФизическихЛицСрезПоследних КАК ВоинскиеСпециальныеЗванияФизическихЛиц";
	
	Выборка = Запрос.Выполнить().Выбрать();

	ВоинскиеСпециальныеЗванияФизическихЛиц.Колонки.Добавить("ТекущееЗначение", Новый ОписаниеТипов("СправочникСсылка.ВоинскиеСпециальныеЗвания"));
	СтруктураПоиска = Новый Структура(КлючевыеИзмерения);
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		СтрокаДвижений = ВоинскиеСпециальныеЗванияФизическихЛиц.НайтиСтроки(СтруктураПоиска)[0];
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, Выборка, "ТекущееЗначение");
	КонецЦикла;
		
	Для Каждого СтрокаДвижений Из ВоинскиеСпециальныеЗванияФизическихЛиц Цикл
		
		Если СтрокаДвижений.ВоинскоеСпециальноеЗвание = СтрокаДвижений.ТекущееЗначение Тогда
			Продолжить;
		КонецЕсли; 
		
		Движения.ВоинскиеСпециальныеЗванияФизическихЛиц.Записывать = Истина;
		
		НоваяСтрока = Движения.ВоинскиеСпециальныеЗванияФизическихЛиц.Добавить();
		НоваяСтрока.Период = СтрокаДвижений.ДатаПрисвоения;
		НоваяСтрока.ФизическоеЛицо = СтрокаДвижений.ФизическоеЛицо;
		НоваяСтрока.ВоинскоеСпециальноеЗвание = СтрокаДвижений.ВоинскоеСпециальноеЗвание;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет наборы записей регистра ОкладыПоВоинскимСпециальнымЗваниям.
// Параметры:
//		Движения - коллекция движений регистратора.
//		ОкладыПоВоинскимСпециальнымЗваниям - таблица значений с колонками
//			Период
//			ВоинскоеСпециальноеЗвание
//			Размер
//
Процедура СформироватьДвиженияОкладовПоВоинскимСпециальнымЗваниям(Движения, ОкладыПоВоинскимСпециальнымЗваниям) Экспорт 
	
	Для Каждого СтрокаДвижений Из ОкладыПоВоинскимСпециальнымЗваниям Цикл
		Движения.ОкладыПоВоинскимСпециальнымЗваниям.Записывать = Истина;
		ЗаполнитьЗначенияСвойств(Движения.ОкладыПоВоинскимСпециальнымЗваниям.Добавить(), СтрокаДвижений);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияДействующихОкладовПоВоинскимСпециальнымЗваниям(ИзмеренияДаты, ИсключаемыйРегистратор = Неопределено) Экспорт 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Ложь;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", ИсключаемыйРегистратор);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ОкладыПоВоинскимСпециальнымЗваниям",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИзмеренияДаты),
		ПараметрыПостроения);
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОкладыПоВоинскимСпециальнымЗваниям.Период,
	               |	ОкладыПоВоинскимСпециальнымЗваниям.ПериодЗаписи,
	               |	ОкладыПоВоинскимСпециальнымЗваниям.ВоинскоеСпециальноеЗвание,
	               |	ОкладыПоВоинскимСпециальнымЗваниям.Размер
	               |ИЗ
	               |	ВТОкладыПоВоинскимСпециальнымЗваниямСрезПоследних КАК ОкладыПоВоинскимСпециальнымЗваниям";
	
	ЗначенияДействующихОкладов = Запрос.Выполнить().Выгрузить();
	ЗначенияДействующихОкладов.Индексы.Добавить("Период, ВоинскоеСпециальноеЗвание");
	
	Возврат ЗначенияДействующихОкладов;
	
КонецФункции

Функция ЗначениеОкладаПоВоинскомуСпециальномуЗванию(ВоинскоеСпециальноеЗвание, ДатаСобытия, ИсключаемыйРегистратор = Неопределено) Экспорт 
	
	ИзмеренияДаты = ИсходныеДанныеДляОпределенияОкладовПоВоинскомуСпециальномуЗванию();
	
	НоваяСтрока = ИзмеренияДаты.Добавить();
	НоваяСтрока.ВоинскоеСпециальноеЗвание = ВоинскоеСпециальноеЗвание;
	НоваяСтрока.Период = ДатаСобытия;
	
	ЗначенияДействующихОкладов = ЗначенияДействующихОкладовПоВоинскимСпециальнымЗваниям(ИзмеренияДаты, ИсключаемыйРегистратор);
	
	Отбор = Новый Структура("Период, ВоинскоеСпециальноеЗвание", ДатаСобытия, ВоинскоеСпециальноеЗвание);
	ДанныеОклада = ЗначенияДействующихОкладов.НайтиСтроки(Отбор);
	
	ЗначениеОклада = ?(ДанныеОклада.Количество() > 0, ДанныеОклада[0].Размер, Неопределено);
	
	Возврат ЗначениеОклада;
	
КонецФункции

Функция ИсходныеДанныеДляОпределенияОкладовПоВоинскомуСпециальномуЗванию() Экспорт 
	
	ИзмеренияДаты = Новый ТаблицаЗначений;
	ИзмеренияДаты.Колонки.Добавить("ВоинскоеСпециальноеЗвание", Новый ОписаниеТипов("СправочникСсылка.ВоинскиеСпециальныеЗвания"));
	ИзмеренияДаты.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Возврат ИзмеренияДаты;
	
КонецФункции

Функция ПоказательОкладПоВоинскомуСпециальномуЗванию() Экспорт 
	
	ИспользоватьРасчетДенежногоДовольствияВоеннослужащих = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоДовольствияВоеннослужащих");
		
	Показатель = ?(ИспользоватьРасчетДенежногоДовольствияВоеннослужащих,
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОкладПоВоинскомуЗванию"),
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОкладПоСпециальномуЗванию"));
		
	Возврат Показатель;	
		
КонецФункции

Функция СведенияОВоинскомСпециальномЗванииСотрудника(Сотрудник, ДатаСобытия = '00010101') Экспорт 
	
	СведенияОВоинскомСпециальномЗвании = Новый Структура("ВоинскоеСпециальноеЗвание, ДатаПрисвоения");
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ДатаСобытия", ДатаСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВоинскиеСпециальныеЗвания.Период КАК Период,
		|	ВоинскиеСпециальныеЗвания.ВоинскоеСпециальноеЗвание КАК ВоинскоеСпециальноеЗвание
		|ИЗ
		|	РегистрСведений.ВоинскиеСпециальныеЗванияФизическихЛиц.СрезПоследних(
		|			&ДатаСобытия,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					ФизическиеЛица.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК ФизическиеЛица)) КАК ВоинскиеСпециальныеЗвания";
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			СведенияОВоинскомСпециальномЗвании.ВоинскоеСпециальноеЗвание = Выборка.ВоинскоеСпециальноеЗвание;
			СведенияОВоинскомСпециальномЗвании.ДатаПрисвоения = Выборка.Период;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияОВоинскомСпециальномЗвании;
	
КонецФункции

Функция ЗачислениеВСпискиЧастиСведенияОВоинскихСпециальныхЗваниях(ДокументСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачислениеВСпискиЧасти.ДатаПрисвоения,
	               |	ЗачислениеВСпискиЧасти.ФизическоеЛицо,
	               |	ЗачислениеВСпискиЧасти.ВоинскоеСпециальноеЗвание
	               |ИЗ
	               |	Документ.ЗачислениеВСпискиЧасти КАК ЗачислениеВСпискиЧасти
	               |ГДЕ
	               |	ЗачислениеВСпискиЧасти.ДатаПрисвоения <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ЗачислениеВСпискиЧасти.ВоинскоеСпециальноеЗвание <> ЗНАЧЕНИЕ(Справочник.ВоинскиеСпециальныеЗвания.ПустаяСсылка)
	               |	И ЗачислениеВСпискиЧасти.Ссылка = &Ссылка
	               |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
	               |	ЗачислениеВСпискиЧасти.ДатаПрисвоения,
	               |	ЗачислениеВСпискиЧасти.ФизическоеЛицо,
	               |	ЗачислениеВСпискиЧасти.ВоинскоеСпециальноеЗвание
	               |ИЗ
	               |	Документ.ЗачислениеВСпискиЧастиСписком.Сотрудники КАК ЗачислениеВСпискиЧасти
	               |ГДЕ
	               |	ЗачислениеВСпискиЧасти.ДатаПрисвоения <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И ЗачислениеВСпискиЧасти.ВоинскоеСпециальноеЗвание <> ЗНАЧЕНИЕ(Справочник.ВоинскиеСпециальныеЗвания.ПустаяСсылка)
	               |	И ЗачислениеВСпискиЧасти.Ссылка = &Ссылка";
				   
	СведенияОВоинскихСпециальныхЗваниях = Запрос.Выполнить().Выгрузить();
	
	Возврат СведенияОВоинскихСпециальныхЗваниях;			   
	
КонецФункции

Функция НачальнаяШтатнаяРасстановкаСведенияОВоинскихСпециальныхЗваниях(ДокументСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачальнаяШтатнаяРасстановка.ДатаПрисвоения,
	               |	НачальнаяШтатнаяРасстановка.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	НачальнаяШтатнаяРасстановка.ВоинскоеСпециальноеЗвание
	               |ИЗ
	               |	Документ.НачальнаяШтатнаяРасстановка.Сотрудники КАК НачальнаяШтатнаяРасстановка
	               |ГДЕ
	               |	НачальнаяШтатнаяРасстановка.ДатаПрисвоения <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И НачальнаяШтатнаяРасстановка.ВоинскоеСпециальноеЗвание <> ЗНАЧЕНИЕ(Справочник.ВоинскиеСпециальныеЗвания.ПустаяСсылка)
	               |	И НачальнаяШтатнаяРасстановка.Ссылка.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ТрудовойДоговор)
	               |	И НачальнаяШтатнаяРасстановка.Ссылка = &Ссылка";
				   
	СведенияОВоинскихСпециальныхЗваниях = Запрос.Выполнить().Выгрузить();
	
	Возврат СведенияОВоинскихСпециальныхЗваниях;			   
	
КонецФункции

Процедура ЗаполнитьЗначениеОкладаПоВоинскомуСпециальномуЗванию(Форма, КоллекцияСтрокНачислений, ОписаниеТаблицы, РежимРаботы, ВоинскоеСпециальноеЗвание, ДатаСобытия) Экспорт 
	
	Показатель = ПоказательОкладПоВоинскомуСпециальномуЗванию();
	ЗначениеПоказателя = ЗначениеОкладаПоВоинскомуСпециальномуЗванию(ВоинскоеСпециальноеЗвание, ДатаСобытия);
			
	ФОИспользоватьВилкуСтавокВШтатномРасписании = Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьВилкуСтавокВШтатномРасписании");
	
	КоличествоПоказателей = ЗарплатаКадрыРасширенныйКлиентСервер.МаксимальноеКоличествоПоказателейПоОписаниюТаблицы(Форма, ОписаниеТаблицы, , РежимРаботы);
	
	Для Каждого СтрокаНачислений Из КоллекцияСтрокНачислений Цикл
		
		Действие = Неопределено;
		СтрокаНачислений.Свойство("Действие", Действие);
		
		Если Действие <> Перечисления.ДействияСНачислениямиИУдержаниями.Отменить Тогда
			Для СчетчикПоказателей = 1 По КоличествоПоказателей Цикл
				Если Не ЗначениеЗаполнено(СтрокаНачислений["Показатель" + СчетчикПоказателей]) Тогда
					Прервать;
				КонецЕсли; 
				Если СтрокаНачислений["Показатель" + СчетчикПоказателей] = Показатель Тогда
					СтрокаНачислений["Значение" + СчетчикПоказателей] = ЗначениеПоказателя;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПрисвоениеВоинскогоСпециальногоЗвания);
	СписокОбъектов.Добавить(Документы.ПрисвоениеВоинскогоСпециальногоЗванияСписком);
	СписокОбъектов.Добавить(Документы.УтверждениеОкладовЗаВоинскиеСпециальныеЗвания);
	
КонецПроцедуры

#КонецОбласти
